app/controllers/articles_controller.rb

    def create
        @article = Article.new(params.require(:article).permit(:title, :text))
        if @article.save
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('test article', 'this the text of test', '2020-05-01 15:46:03.783259', '2020-05-01 15:46:03.783259')